function weatherForecast (){
	var now = new Date()
		,month = now.getMonth()+1
		,Month = month<10 ? "0"+month : month
		,day = now.getDate()
		,today = day + "." + Month
		,weather = {
				"20.01" : "+2 вечірній сніг з перервами"
				,"21.01" : "0 та хмарно"
				,"22.01" : "0 значна хмарність"
				,"23.01" : "-1 хмарно"
				,"24.01" : "+3 хмарно"
				,"25.01" : "-6 вранішня хмарність"
				,"26.01" : "-6 мінлива хмарність"
				,"27.01" : "-4 хмарно"
				,"28.01" : "-3 хмарно"
				,"29.01" : "-1 вечірній сніг з перервами"
				,"30.01" : "-1 сніг з перервами"
				,"31.01" : "-1 вечірній сніг з перервами"
			}
			// today = "32.01";
		if (+today > 31.01){
			alert("Проноз ще не зпрогнозували");
		} else {
			alert("На завтра прогнозують " + weather[today]);
		}
}
weatherForecast();